architecture.md
```mermaid
classDiagram
    class Projeto {
        - nome: string
        - descricao: string
    }

    class Modulo {
        - nome: string
        - descricao: string
        - Projeto: Projeto
    }

    class Documento {
        - versao: string
        - arquivo: string
        - origemAudio: string
        - DocumentoOrigem: Documento*
        - DocumentoAnterior: Documento
        - Modulo: Modulo
        - TipoDocumento: DOCS
    }

    class DOCS {
        MINIMUNDO
        REQUISITOS
        CASO_USO
        DIAGRAMA_CLASSE
        PROTOTIPO_INTERFACE
    }

    Projeto "1" -- "0..*" Modulo
    Modulo "1" -- "0..*" Documento
    Documento -- "1" DOCS
```
